
package knowledge;

public class Day01_Overview {
	
	/*
	 * JDK: java开发工具包
	 * JRE: java运行时环境
	 * JVM: java虚拟机
	 * 
	 * JDK = JRE + Java开发工具集
	 * JRE = JVM + Java核心类库
	 */
	
	/*
	 * java注释
	 * 单行注释
	 * 多行注释
	 * 文档注释
	 */
	
	/*
	 * 关键字：被java语言赋予了特殊含义的字符串（单词）
	 * 保留字：java现有版本中没有特殊含义，以后版本可能会作为有特殊含义的词
	 * 标识符：凡是自己命名的部分称为标识符
	 * 
	 * 标识符的命名规则：
	 * > java严格区分大小写
	 * > 只能用26个大小写英文字母、数字、下划线、$进行命名
	 * > 数字不能开头
	 * > 不能使用关键字或保留字作为标识符，标识符可以包含关键字或保留字
	 * 
	 * 标识符的命名规范
	 * > 包名，全部小写
	 * > 类、接口名，每个单词的首字母大写
	 * > 变量、方法名，第一个单词首字母小写，其后每个单词的首字母都大写
	 * > 常量，每个字母都大写，每个单词之间用_连接
	 */
	
	
	
}
